use selpo;

INSERT INTO `catalogs` (`id`, `name`) VALUES ('1', 'Фрукты и овощи');
INSERT INTO `catalogs` (`id`, `name`) VALUES ('2', 'Мясо, рыба и птица');
INSERT INTO `catalogs` (`id`, `name`) VALUES ('3', 'Чай, кофе');
INSERT INTO `catalogs` (`id`, `name`) VALUES ('4', 'Специи, соль и сахар');
INSERT INTO `catalogs` (`id`, `name`) VALUES ('5', 'Хлебобулочные изделия');
INSERT INTO `catalogs` (`id`, `name`) VALUES ('6', 'Макароны');
INSERT INTO `catalogs` (`id`, `name`) VALUES ('7', 'Воды, напитки');
INSERT INTO `catalogs` (`id`, `name`) VALUES ('8', 'Консервы');
INSERT INTO `catalogs` (`id`, `name`) VALUES ('9', 'Замороженная продукция');
INSERT INTO `catalogs` (`id`, `name`) VALUES ('10', 'Молочная продукция');
INSERT INTO `catalogs` (`id`, `name`) VALUES ('11', 'Гречка');
INSERT INTO `catalogs` (`id`, `name`) VALUES ('12', 'Рис');

INSERT INTO `clients` VALUES ('1','Иван','Иванов','89674572972 '),
('2','Петр','Петров','89674572971'),
('3','Сидор','Сидоров','89674572970'),
('4','Олег','Олегов','89674572973'),
('5','Кирилл','Кириллов','89674572974'),
('6','Евгений','Евгеньев','89674572934'),
('7','Леонид','Леонидов','89674572935'); 

INSERT INTO `suppliers` VALUES ('1','ИП Иванов', 'Москва, Кирпичные выемки, 6а','84953764542','keith44@example.com'),
('2','Поставщичок', 'Реутов, улица Ленина, 7','84953344542','hkbhkb44@example.com'),
('3','Deliver&supply', 'Химки, улица Центральная, 8','84953064542','bhkvbuytyd@example.com'); 


INSERT INTO `goods` VALUES ('1','Помидоры','1','3','Desc','60'),
('2','Яблоки','1','3','Desc','57'), ('3','Говяжья вырезка','2','3','Desc','300'),
('4','Куриное филе','2','1','Desc','250'), ('5','Greeenfield','3','3','Desc','99'),
('6','Nescafe','3','3','Desc','210'), ('7','Соль крупного помола','4','2','Desc','75');
INSERT INTO `goods` VALUES ('8','Сахар рафинад','4','3','Desc','45'), ('9','Хлеб белый','5','3','Desc','30'),
('10','Хлеб ржаной','5','1','Desc','45'), ('11','Спагетти','6','1','Desc','89'),
('12','Гречневая каша особая','11','3','Desc','67'), ('13','Fanta','7','3','Desc','45');
INSERT INTO `goods` VALUES ('14','Sprite','7','3','Desc','39'), ('15','Тушенка особая','8','2','Desc','120'),
('16','Завтрак туриста','8','3','Desc','154'), ('17','Пельмени сибирские','9','3','Desc','450'),
('18','Гавайская смесь','9','1','Desc','100'), ('19','Молоко Простоквашино','10','2','Desc','99');
INSERT INTO `goods` VALUES ('20','Творог Простоквашино','10','3','Desc','110'), ('21','Огурцы','1','3','Desc','70'),
('22','Тунец','2','3','Desc','230'), ('23','Майский чай','3','3','Desc','119'),
('24','Кавказские специи','4','3','Desc','30'), ('25','Рис Кубань','12','1','Desc','99');
INSERT INTO `goods` VALUES
('26','Багет французский','5','3','Desc','45'), ('27','Вода снежская','7','2','Desc','29'),
('28','Тунец конс.','8','2','Desc','190'), ('29','Пицца итальянская','9','3','Desc','250'),
('30','Гречка наивкуснейшая','11','2','Desc','89'), ('31','Гречневая каша богатая','11','1','Desc','120'); 


INSERT INTO `full_purchase` VALUES ('1','1',417,'2020-09-01 18:47:11');  
INSERT INTO `full_purchase` VALUES ('2','2',559,'2020-09-02 01:10:00'); 
INSERT INTO `full_purchase` VALUES ('3','3',75,'2020-09-03 06:07:00');
INSERT INTO `full_purchase` VALUES ('4','4',45, '2020-09-04 06:07:00');
INSERT INTO `full_purchase` VALUES ('5','5',30,'2020-09-05 07:53:43');
INSERT INTO `full_purchase` VALUES ('6','6',45,'2020-09-06 17:05:42');
INSERT INTO `full_purchase` VALUES ('7','1',89,'2020-09-07 18:47:11');  
INSERT INTO `full_purchase` VALUES ('8','1',67,'2020-10-01 18:47:11'); 
INSERT INTO `full_purchase` VALUES ('9','1',45,'2020-10-02 18:47:11');
INSERT INTO `full_purchase` VALUES ('10','2',39,'2020-10-03 18:47:11');    
INSERT INTO `full_purchase` VALUES ('11','7',700,'2020-10-04 18:47:11');  
INSERT INTO `full_purchase` VALUES ('12','3',190,'2020-10-04 18:48:11');
INSERT INTO `full_purchase` VALUES ('13','4',30,'2020-10-05 18:48:11');
INSERT INTO `full_purchase` VALUES ('14','5',30,'2020-10-05 19:53:43');
INSERT INTO `full_purchase` VALUES ('15','5',30,'2020-10-06 07:53:43');   
INSERT INTO `full_purchase` VALUES ('16','6',0.1,'2020-10-06 17:05:42');

INSERT INTO `purchases` VALUES ('1','1','1'), ('2','2','1'),('3','3','1'),
 ('4','4','2'), ('5','5','2'), ('6','6','2'),
 ('7','7','3'), ('8','8','4'), ('9','9','5'), ('10','10','6'), ('11','11','7'), ('12','12','8'), ('13','13','9'),
 ('14','14','10'), ('15','17','11'), ('16','19','11'), ('17','28','12'), ('18','24','13'), ('19','9','14'), ('20','9','15'); 

